In [118]:
import numpy as np
import pandas as pd

In [119]:
from numpy.random import randn
np.random.seed(103)

In [120]:
df=pd.DataFrame(randn(5,5),['A','B','C','D','E'],['U','V','W','X','Y'])

In [121]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [122]:
df>0

       U      V      W      X      Y
A  False  False   True  False  False
B   True   True   True  False  False
C   True  False   True   True  False
D  False   True  False   True   True
E   True  False   True   True  False

In [123]:
df['X']>0

A    False
B    False
C     True
D     True
E     True
Name: X, dtype: bool

In [124]:
 df[df['X']>0]

          U         V         W         X         Y
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [125]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [126]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [127]:
df['X']+df['Y']

A   -1.470598
B   -1.611977
C    0.392977
D    2.009461
E    1.320381
dtype: float64

In [128]:
sherlock=df[df['U']>0]

In [129]:
sherlock

          U         V         W         X         Y
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [130]:
sherlock['X']

B   -0.980011
C    1.594922
E    1.516358
Name: X, dtype: float64

In [131]:
df[df['U']>0]['X']

B   -0.980011
C    1.594922
E    1.516358
Name: X, dtype: float64

In [132]:
df[df['U']>0][['X','Y']]

          X         Y
B -0.980011 -0.631965
C  1.594922 -1.201945
E  1.516358 -0.195977

In [133]:
ramesh=df['U']>0
sherlock=df[ramesh]
need=['X','Y']
sherlock[need]

          X         Y
B -0.980011 -0.631965
C  1.594922 -1.201945
E  1.516358 -0.195977